Revit 2027 API
BuiltInFailures.ConstraintFailures Class
 Failures about Constraint.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.ConstraintFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class ConstraintFailures
Public NotInheritable Class ConstraintFailures
public ref class ConstraintFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type ConstraintFailures = class end
The BuiltInFailures.ConstraintFailures type exposes the following members.
Properties
Name | Description
UndeletedConstraints |  A dimension that has lock constraints is being deleted, but the elements will still be constrained. Push "Unconstrain" to remove the constraints or "OK" to leave elements constrained..
UndeletedConstraintsEQ |  A dimension that has EQ constraints is being deleted, but the elements will still be constrained. Push "Unconstrain" to remove the constraints or "OK" to leave elements constrained..
UndeletedConstraintsInGroup |  A labeled dimension is being deleted, but the corresponding constraint belongs to a group and will not be changed. You can change it in group edit mode later.
UndeletedConstraintsLabel |  A dimension labeled by a parameter is being deleted, but the elements will still be constrained. Push "Unconstrain" to remove the constraints or "OK" to leave elements constrained..
Top
See Also
Reference
Autodesk.Revit.DB Namespace